W4D5/music_app/app/controllers/albums_controller.rb

  def create
    album = Album.new(album_params)
    if album.save!
---
INSERT INTO "albums" ("title", "year", "band_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["title", "Meow the Jewels"], ["year", "2014"], ["band_id", 1], ["created_at", "2018-06-14 18:59:09.914154"], ["updated_at", "2018-06-14 18:59:09.914154"]]

  def update
    album = current_album
    album_params.each do |key, val|
      album[key] = val
    end
    if album.save!
---
UPDATE "albums" SET "title" = $1, "year" = $2, "band_id" = $3, "live?" = $4, "updated_at" = $5 WHERE "albums"."id" = $6  [["title", " Weird shit2"], ["year", "2015"], ["band_id", 7], ["live?", "t"], ["updated_at", "2018-06-14 20:11:22.740450"], ["id", 2]]