W4D5/music_app/app/controllers/bands_controller.rb

INSERT INTO "bands" ("name") VALUES ($1) RETURNING "id"  [["name", "Run the Jewels"]]
---
  def create
    band = Band.new(band_params)
    if band.save!

SELECT  "bands".* FROM "bands" WHERE "bands"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
UPDATE "bands" SET "name" = $1 WHERE "bands"."id" = $2  [["name", "asdfff"], ["id", 5]]
---
  def update
    band = Band.find(params[:id])

    if band
      # band_params.each do |k,v|
      #   band.k
      # end
      band.name = band_params[:name]
      if band.save!

SELECT  "bands".* FROM "bands" WHERE "bands"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]
DELETE FROM "bands" WHERE "bands"."id" = $1  [["id", 5]]
---
  def destroy
    #should add something to check that you "own " this band
    band = Band.find(params[:id])
    band.delete