W4D5/music_app/app/controllers/tracks_controller.rb

  def create
    track = Track.new(track_params)
    if track.save
---
INSERT INTO "tracks" ("title", "ord", "lyrics", "album_id") VALUES ($1, $2, $3, $4) RETURNING "id"  [["title", "Enter the Ninja"], ["ord", 1], ["lyrics", "Who knows"], ["album_id", 2]]