W4D5/music_app/app/controllers/users_controller.rb

INSERT INTO "users" ("email", "session_token", "password_digest") VALUES ($1, $2, $3) RETURNING "id"  [["email", "jeff"], ["session_token", "-fcndEvEdu7uw2rwDFRquA"], ["password_digest", "$2a$10$5S4JRWs8CDv.Ror6hWqNyeMTVmWdsNGsGfaaoB9a7yAbih2ST7dkS"]]
---
  def create
    @user = User.new(user_params)
    if @user.save!