W4D5/music_app/app/views/tracks/edit.html.erb

  <select class="album" name="track[album_id]">
    <% Album.all.each do |album| %>
---
SELECT "albums".* FROM "albums"