W4D5/music_app/app/views/tracks/new.html.erb

SELECT "albums".* FROM "albums"
---
  <select class="album" name="track[album_id]">
    <% Album.all.each do |album| %>