W4D5/music_app/app/views/tracks/show.html.erb

SELECT  "albums".* FROM "albums" WHERE "albums"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
---
<% when "album_id" %>
  <%= "Album: #{Album.find(@track.album_id).title}" %>