W4D5/music_app/app/views/albums/new.html.erb

SELECT "bands".* FROM "bands"
---
  <select class="album_artist" name="album[band_id]">
    <% Band.all.each do |band| %>