W4D5/music_app/app/views/albums/show.html.erb

  <% when "band_id" %>
    <%= "Band: #{Band.find(@album.band_id).name}" %>
---
SELECT  "bands".* FROM "bands" WHERE "bands"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

<ul class="tracks">
  <% @album.tracks.each do |track| %>
---
SELECT "tracks".* FROM "tracks" WHERE "tracks"."album_id" = $1  [["album_id", 2]]